import 'package:flutter/material.dart';
import 'package:flutter/foundation.dart';
import 'package:shared_preferences/shared_preferences.dart';

const _kLocaleStorageKey = '__locale_key__';

class FFLocalizations {
  FFLocalizations(this.locale);

  final Locale locale;

  static FFLocalizations of(BuildContext context) =>
      Localizations.of<FFLocalizations>(context, FFLocalizations)!;

  static List<String> languages() => ['en', 'ta', 'ml', 'te'];

  static late SharedPreferences _prefs;
  static Future initialize() async =>
      _prefs = await SharedPreferences.getInstance();
  static Future storeLocale(String locale) =>
      _prefs.setString(_kLocaleStorageKey, locale);
  static Locale? getStoredLocale() {
    final locale = _prefs.getString(_kLocaleStorageKey);
    return locale != null && locale.isNotEmpty ? createLocale(locale) : null;
  }

  String get languageCode => locale.toString();
  int get languageIndex => languages().contains(languageCode)
      ? languages().indexOf(languageCode)
      : 0;

  String getText(String key) =>
      (kTranslationsMap[key] ?? {})[locale.toString()] ?? '';

  String getVariableText({
    String? enText = '',
    String? taText = '',
    String? mlText = '',
    String? teText = '',
  }) =>
      [enText, taText, mlText, teText][languageIndex] ?? '';
}

class FFLocalizationsDelegate extends LocalizationsDelegate<FFLocalizations> {
  const FFLocalizationsDelegate();

  @override
  bool isSupported(Locale locale) {
    final language = locale.toString();
    return FFLocalizations.languages().contains(
      language.endsWith('_')
          ? language.substring(0, language.length - 1)
          : language,
    );
  }

  @override
  Future<FFLocalizations> load(Locale locale) =>
      SynchronousFuture<FFLocalizations>(FFLocalizations(locale));

  @override
  bool shouldReload(FFLocalizationsDelegate old) => false;
}

Locale createLocale(String language) => language.contains('_')
    ? Locale.fromSubtags(
        languageCode: language.split('_').first,
        scriptCode: language.split('_').last,
      )
    : Locale(language);

final kTranslationsMap = <Map<String, Map<String, String>>>[
  // phoneNumber
  {
    'w1xgmo4g': {
      'en': 'Phone Number',
      'ml': 'ഫോൺ നമ്പർ',
      'ta': 'தொலைபேசி எண்',
      'te': 'ఫోను నంబరు',
    },
    'rjcjxkso': {
      'en': 'Enter your 10 digit phone number to proceed',
      'ml': 'തുടരാൻ നിങ്ങളുടെ 10 അക്ക ഫോൺ നമ്പർ നൽകുക',
      'ta': 'தொடர உங்கள் 10 இலக்க தொலைபேசி எண்ணை உள்ளிடவும்',
      'te': 'కొనసాగడానికి మీ 10 అంకెల ఫోన్ నంబర్‌ను నమోదు చేయండి',
    },
    'a3o3z47i': {
      'en': '10 Digit Phone Number',
      'ml': '10 അക്ക ഫോൺ നമ്പർ',
      'ta': '10 இலக்க தொலைபேசி எண்',
      'te': '10 అంకెల ఫోన్ నంబర్',
    },
    '7gwwp9kh': {
      'en': 'Submit',
      'ml': 'സമർപ്പിക്കുക',
      'ta': 'சமர்ப்பிக்கவும்',
      'te': 'సమర్పించండి',
    },
    'tr8zfgyg': {
      'en': 'Field is required',
      'ml': 'ഫീൽഡ് ആവശ്യമാണ്',
      'ta': 'இந்த பகுதி அவசியமானது',
      'te': 'ఫీల్డ్ అవసరం',
    },
    'bgmor8wu': {
      'en': 'Please choose an option from the dropdown',
      'ml': 'ഡ്രോപ്പ്ഡൗണിൽ നിന്ന് ഒരു ഓപ്ഷൻ തിരഞ്ഞെടുക്കുക',
      'ta': 'கீழ்தோன்றலில் இருந்து ஒரு விருப்பத்தைத் தேர்ந்தெடுக்கவும்',
      'te': 'దయచేసి డ్రాప్‌డౌన్ నుండి ఒక ఎంపికను ఎంచుకోండి',
    },
    'a1cowysm': {
      'en': 'Home',
      'ml': 'വീട്',
      'ta': 'வீடு',
      'te': 'హోమ్',
    },
  },
  // otpVerification
  {
    'kazhtth8': {
      'en': 'OTP',
      'ml': 'OTP',
      'ta': 'OTP',
      'te': 'OTP',
    },
    'jwcvz68g': {
      'en': 'Enter 6 Digit OTP sent to +91 ',
      'ml': '+91-ലേക്ക് അയച്ച 6 അക്ക OTP നൽകുക',
      'ta': '+91 க்கு அனுப்பப்பட்ட 6 இலக்க OTP ஐ உள்ளிடவும்',
      'te': '+91కి పంపబడిన 6 అంకెల OTPని నమోదు చేయండి',
    },
    'wpxxnezx': {
      'en': '6 Digit Code',
      'ml': '6 ഡിജിറ്റ് കോഡ്',
      'ta': '6 இலக்கக் குறியீடு',
      'te': '6 అంకెల కోడ్',
    },
    'vk519vt1': {
      'en': 'Verify',
      'ml': 'സ്ഥിരീകരിക്കുക',
      'ta': 'சரிபார்க்கவும்',
      'te': 'ధృవీకరించండి',
    },
    'le4tc5q6': {
      'en': 'Field is required',
      'ml': 'ഫീൽഡ് ആവശ്യമാണ്',
      'ta': 'இந்த பகுதி அவசியமானது',
      'te': 'ఫీల్డ్ అవసరం',
    },
    'kq95vstw': {
      'en': 'Please choose an option from the dropdown',
      'ml': 'ഡ്രോപ്പ്ഡൗണിൽ നിന്ന് ഒരു ഓപ്ഷൻ തിരഞ്ഞെടുക്കുക',
      'ta': 'கீழ்தோன்றலில் இருந்து ஒரு விருப்பத்தைத் தேர்ந்தெடுக்கவும்',
      'te': 'దయచేసి డ్రాప్‌డౌన్ నుండి ఒక ఎంపికను ఎంచుకోండి',
    },
    '506qwbg9': {
      'en': 'Home',
      'ml': 'വീട്',
      'ta': 'வீடு',
      'te': 'హోమ్',
    },
  },
  // Homepage
  {
    'xw5g36u7': {
      'en': '🙏 Priase the Lord',
      'ml': '🙏 കർത്താവിനെ വാഴ്ത്തുക',
      'ta': '🙏 இறைவனைப் போற்றுங்கள்',
      'te': '🙏 ప్రభువును ప్రసన్నం చేసుకోండి',
    },
    'usce0w4r': {
      'en': 'How can we help \nyou today ?',
      'ml': 'നമുക്ക് എങ്ങനെ സഹായിക്കാനാകും\nനീ ഇന്ന്?',
      'ta': 'நாங்கள் உங்களுக்கு எப்படி உதவ முடியும்\nஇன்று நீ ?',
      'te': 'మేము ఏ విధంగా సహయపడగలము\nమీరు ఈ రోజు?',
    },
    '5cer9bte': {
      'en': 'Upload Profile',
      'ml': 'പ്രൊഫൈൽ അപ്‌ലോഡ് ചെയ്യുക',
      'ta': 'சுயவிவரத்தைப் பதிவேற்றவும்',
      'te': 'ప్రొఫైల్‌ను అప్‌లోడ్ చేయండి',
    },
    'sfef3koz': {
      'en': 'I’m here to upload my Profile For the listings',
      'ml':
          'ലിസ്റ്റിംഗുകൾക്കായി എന്റെ പ്രൊഫൈൽ അപ്‌ലോഡ് ചെയ്യാൻ ഞാൻ ഇവിടെയുണ്ട്',
      'ta':
          'பட்டியல்களுக்கான எனது சுயவிவரத்தைப் பதிவேற்ற நான் இங்கு வந்துள்ளேன்',
      'te': 'జాబితాల కోసం నా ప్రొఫైల్‌ను అప్‌లోడ్ చేయడానికి నేను ఇక్కడ ఉన్నాను',
    },
    '5itcpows': {
      'en': 'View Listings',
      'ml': 'ലിസ്റ്റിംഗുകൾ കാണുക',
      'ta': 'பட்டியல்களைக் காண்க',
      'te': 'జాబితాలను వీక్షించండి',
    },
    'h4vonk0t': {
      'en': 'I’m here see the listings to find potential bride/groom',
      'ml': 'സാധ്യതയുള്ള വധുവിനെ/വരനെ കണ്ടെത്താൻ ഞാൻ ഇവിടെയുണ്ട്',
      'ta':
          'சாத்தியமான மணமகன்/மாப்பிள்ளையைக் கண்டறியும் பட்டியலைப் பார்க்க வந்துள்ளேன்',
      'te':
          'సంభావ్య వధువు/వరుడిని కనుగొనడానికి నేను ఇక్కడ జాబితాలను చూస్తున్నాను',
    },
    '6bvxun0a': {
      'en': 'About Us',
      'ml': 'ഞങ്ങളേക്കുറിച്ച്',
      'ta': 'எங்களை பற்றி',
      'te': 'మా గురించి',
    },
    'x87e3qkb': {
      'en': 'Home',
      'ml': 'വീട്',
      'ta': 'வீடு',
      'te': 'హోమ్',
    },
  },
  // uploadProfile
  {
    'a17mb4hg': {
      'en': 'Full Name',
      'ml': 'പൂർണ്ണമായ പേര്',
      'ta': 'முழு பெயர்',
      'te': 'పూర్తి పేరు',
    },
    'hh97zmgy': {
      'en': 'Gender',
      'ml': 'ലിംഗഭേദം',
      'ta': 'பாலினம்',
      'te': 'లింగం',
    },
    'js5xmb3a': {
      'en': 'Address Line',
      'ml': 'വിലാസ ലൈൻ',
      'ta': 'முகவரி வரி',
      'te': 'చిరునామా లైన్',
    },
    '8x24jgs4': {
      'en': 'Pincode',
      'ml': 'പിൻ കോഡ്',
      'ta': 'அஞ்சல் குறியீடு',
      'te': 'పిన్ కోడ్',
    },
    'zxgyhb77': {
      'en': 'Phone Number',
      'ml': 'ഫോൺ നമ്പർ',
      'ta': 'தொலைபேசி எண்',
      'te': 'ఫోను నంబరు',
    },
    'cx8fp1lm': {
      'en': 'Educational Qualification',
      'ml': 'വിദ്യാഭ്യാസ യോഗ്യത',
      'ta': 'கல்வி தகுதி',
      'te': 'అర్హతలు',
    },
    'ro4683x4': {
      'en': 'Income Range',
      'ml': 'വരുമാന പരിധി',
      'ta': 'வருமான வரம்பு',
      'te': 'ఆదాయ పరిధి',
    },
    'a09hu6j5': {
      'en': 'Submit',
      'ml': 'സമർപ്പിക്കുക',
      'ta': 'சமர்ப்பிக்கவும்',
      'te': 'సమర్పించండి',
    },
    'zowfgjxx': {
      'en': 'Field is required',
      'ml': 'ഫീൽഡ് ആവശ്യമാണ്',
      'ta': 'இந்த பகுதி அவசியமானது',
      'te': 'ఫీల్డ్ అవసరం',
    },
    't1k4gzh7': {
      'en': 'Please choose an option from the dropdown',
      'ml': 'ഡ്രോപ്പ്ഡൗണിൽ നിന്ന് ഒരു ഓപ്ഷൻ തിരഞ്ഞെടുക്കുക',
      'ta': 'கீழ்தோன்றலில் இருந்து ஒரு விருப்பத்தைத் தேர்ந்தெடுக்கவும்',
      'te': 'దయచేసి డ్రాప్‌డౌన్ నుండి ఒక ఎంపికను ఎంచుకోండి',
    },
    'bzlepr4n': {
      'en': 'Field is required',
      'ml': 'ഫീൽഡ് ആവശ്യമാണ്',
      'ta': 'இந்த பகுதி அவசியமானது',
      'te': 'ఫీల్డ్ అవసరం',
    },
    '48h46ij9': {
      'en': 'Please choose an option from the dropdown',
      'ml': 'ഡ്രോപ്പ്ഡൗണിൽ നിന്ന് ഒരു ഓപ്ഷൻ തിരഞ്ഞെടുക്കുക',
      'ta': 'கீழ்தோன்றலில் இருந்து ஒரு விருப்பத்தைத் தேர்ந்தெடுக்கவும்',
      'te': 'దయచేసి డ్రాప్‌డౌన్ నుండి ఒక ఎంపికను ఎంచుకోండి',
    },
    'lggakh6n': {
      'en': 'Field is required',
      'ml': 'ഫീൽഡ് ആവശ്യമാണ്',
      'ta': 'இந்த பகுதி அவசியமானது',
      'te': 'ఫీల్డ్ అవసరం',
    },
    'd1flpanj': {
      'en': 'Please choose an option from the dropdown',
      'ml': 'ഡ്രോപ്പ്ഡൗണിൽ നിന്ന് ഒരു ഓപ്ഷൻ തിരഞ്ഞെടുക്കുക',
      'ta': 'கீழ்தோன்றலில் இருந்து ஒரு விருப்பத்தைத் தேர்ந்தெடுக்கவும்',
      'te': 'దయచేసి డ్రాప్‌డౌన్ నుండి ఒక ఎంపికను ఎంచుకోండి',
    },
    '8v8kra0z': {
      'en': 'Field is required',
      'ml': 'ഫീൽഡ് ആവശ്യമാണ്',
      'ta': 'இந்த பகுதி அவசியமானது',
      'te': 'ఫీల్డ్ అవసరం',
    },
    '0khsf18u': {
      'en': 'Please choose an option from the dropdown',
      'ml': 'ഡ്രോപ്പ്ഡൗണിൽ നിന്ന് ഒരു ഓപ്ഷൻ തിരഞ്ഞെടുക്കുക',
      'ta': 'கீழ்தோன்றலில் இருந்து ஒரு விருப்பத்தைத் தேர்ந்தெடுக்கவும்',
      'te': 'దయచేసి డ్రాప్‌డౌన్ నుండి ఒక ఎంపికను ఎంచుకోండి',
    },
    'cwtifvgw': {
      'en': 'Field is required',
      'ml': 'ഫീൽഡ് ആവശ്യമാണ്',
      'ta': 'இந்த பகுதி அவசியமானது',
      'te': 'ఫీల్డ్ అవసరం',
    },
    'zn4iaeup': {
      'en': 'Please choose an option from the dropdown',
      'ml': 'ഡ്രോപ്പ്ഡൗണിൽ നിന്ന് ഒരു ഓപ്ഷൻ തിരഞ്ഞെടുക്കുക',
      'ta': 'கீழ்தோன்றலில் இருந்து ஒரு விருப்பத்தைத் தேர்ந்தெடுக்கவும்',
      'te': 'దయచేసి డ్రాప్‌డౌన్ నుండి ఒక ఎంపికను ఎంచుకోండి',
    },
    '9ytbeevb': {
      'en': 'Field is required',
      'ml': 'ഫീൽഡ് ആവശ്യമാണ്',
      'ta': 'இந்த பகுதி அவசியமானது',
      'te': 'ఫీల్డ్ అవసరం',
    },
    'vqjev2cx': {
      'en': 'Please choose an option from the dropdown',
      'ml': 'ഡ്രോപ്പ്ഡൗണിൽ നിന്ന് ഒരു ഓപ്ഷൻ തിരഞ്ഞെടുക്കുക',
      'ta': 'கீழ்தோன்றலில் இருந்து ஒரு விருப்பத்தைத் தேர்ந்தெடுக்கவும்',
      'te': 'దయచేసి డ్రాప్‌డౌన్ నుండి ఒక ఎంపికను ఎంచుకోండి',
    },
    'ntdk11i4': {
      'en': 'Field is required',
      'ml': 'ഫീൽഡ് ആവശ്യമാണ്',
      'ta': 'இந்த பகுதி அவசியமானது',
      'te': 'ఫీల్డ్ అవసరం',
    },
    'oemr2pgm': {
      'en': 'Please choose an option from the dropdown',
      'ml': 'ഡ്രോപ്പ്ഡൗണിൽ നിന്ന് ഒരു ഓപ്ഷൻ തിരഞ്ഞെടുക്കുക',
      'ta': 'கீழ்தோன்றலில் இருந்து ஒரு விருப்பத்தைத் தேர்ந்தெடுக்கவும்',
      'te': 'దయచేసి డ్రాప్‌డౌన్ నుండి ఒక ఎంపికను ఎంచుకోండి',
    },
    'dl0zt12v': {
      'en': 'Upload Profile',
      'ml': 'പ്രൊഫൈൽ അപ്‌ലോഡ് ചെയ്യുക',
      'ta': 'சுயவிவரத்தைப் பதிவேற்றவும்',
      'te': 'ప్రొఫైల్‌ను అప్‌లోడ్ చేయండి',
    },
    'lw12rmy9': {
      'en': 'Home',
      'ml': 'വീട്',
      'ta': 'வீடு',
      'te': 'హోమ్',
    },
  },
  // viewListing
  {
    'x6vg16b9': {
      'en': 'Elizabeth Surya',
      'ml': 'എലിസബത്ത് സൂര്യ',
      'ta': 'எலிசபெத் சூர்யா',
      'te': 'ఎలిజబెత్ సూర్య',
    },
    'ktrnuumv': {
      'en': '26 Yrs, Krishnagire',
      'ml': '26 വയസ്സ്, കൃഷ്ണഗിരി',
      'ta': '26 வயது, கிருஷ்ணகிரி',
      'te': '26 సంవత్సరాలు, కృష్ణగిరే',
    },
    '2k8rxmbo': {
      'en': 'View Listing',
      'ml': 'ലിസ്റ്റിംഗ് കാണുക',
      'ta': 'பட்டியலைக் காண்க',
      'te': 'జాబితాను వీక్షించండి',
    },
    '4qnmcgt2': {
      'en': 'Home',
      'ml': 'വീട്',
      'ta': 'வீடு',
      'te': 'హోమ్',
    },
  },
  // SplashScreen
  {
    'p8x9lm5s': {
      'en': 'ELIEZER',
      'ml': 'എലീസർ',
      'ta': 'எலியேசர்',
      'te': 'ఎలియేజర్',
    },
    'z53fudjq': {
      'en': 'Home',
      'ml': 'വീട്',
      'ta': 'வீடு',
      'te': 'హోమ్',
    },
  },
  // uploadProfileEmpty
  {
    'ets0h05q': {
      'en': 'Upload Profile Picture',
      'ml': 'പ്രൊഫൈൽ ചിത്രം അപ്‌ലോഡ് ചെയ്യുക',
      'ta': 'சுயவிவரப் படத்தைப் பதிவேற்றவும்',
      'te': 'ప్రొఫైల్ చిత్రాన్ని అప్‌లోడ్ చేయండి',
    },
    '2h4e5he4': {
      'en': 'Picture should be a face close up',
      'ml': 'ചിത്രം ഒരു മുഖം അടുത്ത് ആയിരിക്കണം',
      'ta': 'படம் நெருக்கமாக முகமாக இருக்க வேண்டும்',
      'te': 'చిత్రం ముఖం దగ్గరగా ఉండాలి',
    },
  },
  // chooseLanguage
  {
    'lzbo4f7n': {
      'en': 'Choose a Language',
      'ml': 'ഒരു ഭാഷ തിരഞ്ഞെടുക്കുക',
      'ta': 'ஒரு மொழியைத் தேர்ந்தெடுக்கவும்',
      'te': 'ఒక భాషను ఎంచుకోండి',
    },
    'klcn339e': {
      'en': 'English',
      'ml': 'ഇംഗ്ലീഷ്',
      'ta': 'ஆங்கிலம்',
      'te': 'ఆంగ్ల',
    },
    'wvi91y57': {
      'en': 'தமிழ்',
      'ml': 'തമിഴ്',
      'ta': 'தமிழ்',
      'te': 'తెలుగు',
    },
    'ymllbwsj': {
      'en': 'മലയാളം',
      'ml': 'മലയാളം',
      'ta': 'மலையாளம்',
      'te': 'తెలుగు',
    },
    'r6v0ns1y': {
      'en': 'తెలుగు',
      'ml': 'തെലുങ്ക്',
      'ta': 'தெலுங்கு',
      'te': 'తెలుగు',
    },
  },
  // filter
  {
    'y4loajw4': {
      'en': 'What you looking for ?',
      'ml': 'നീ എന്താണ് അന്വേഷിക്കുന്നത് ?',
      'ta': 'என்ன தேடுகிறாய் ?',
      'te': 'దేని గురించి వెతుకుతున్నారు ?',
    },
    'y80thy9f': {
      'en': 'Male',
      'ml': 'ആൺ',
      'ta': 'ஆண்',
      'te': 'పురుషుడు',
    },
    '2maj77ls': {
      'en': 'Female',
      'ml': 'സ്ത്രീ',
      'ta': 'பெண்',
      'te': 'స్త్రీ',
    },
    'jftrpbk1': {
      'en': 'Choose Gender',
      'ml': 'ലിംഗഭേദം തിരഞ്ഞെടുക്കുക',
      'ta': 'பாலினத்தைத் தேர்ந்தெடுக்கவும்',
      'te': 'లింగాన్ని ఎంచుకోండి',
    },
    'gqblzigs': {
      'en': 'Option 1',
      'ml': 'ഓപ്ഷൻ 1',
      'ta': 'விருப்பம் 1',
      'te': 'ఎంపిక 1',
    },
    'nqhb4mev': {
      'en': 'Choose District',
      'ml': 'ജില്ല തിരഞ്ഞെടുക്കുക',
      'ta': 'மாவட்டத்தை தேர்வு செய்யவும்',
      'te': 'జిల్లాను ఎంచుకోండి',
    },
    'irrgg5vw': {
      'en': 'From Age',
      'ml': 'പ്രായം മുതൽ',
      'ta': 'வயதில் இருந்து',
      'te': 'వయస్సు నుండి',
    },
    'rxrfg9ft': {
      'en': 'To Age',
      'ml': 'പ്രായത്തിലേക്ക്',
      'ta': 'வயதுக்கு',
      'te': 'వయసుకు',
    },
    'myqkqkn9': {
      'en': 'Submit',
      'ml': 'സമർപ്പിക്കുക',
      'ta': 'சமர்ப்பிக்கவும்',
      'te': 'సమర్పించండి',
    },
    '4vajna4v': {
      'en': 'Field is required',
      'ml': 'ഫീൽഡ് ആവശ്യമാണ്',
      'ta': 'இந்த பகுதி அவசியமானது',
      'te': 'ఫీల్డ్ అవసరం',
    },
    'cg2nbbcc': {
      'en': 'Please choose an option from the dropdown',
      'ml': 'ഡ്രോപ്പ്ഡൗണിൽ നിന്ന് ഒരു ഓപ്ഷൻ തിരഞ്ഞെടുക്കുക',
      'ta': 'கீழ்தோன்றலில் இருந்து ஒரு விருப்பத்தைத் தேர்ந்தெடுக்கவும்',
      'te': 'దయచేసి డ్రాప్‌డౌన్ నుండి ఒక ఎంపికను ఎంచుకోండి',
    },
    'pj0o3xv9': {
      'en': 'Field is required',
      'ml': 'ഫീൽഡ് ആവശ്യമാണ്',
      'ta': 'இந்த பகுதி அவசியமானது',
      'te': 'ఫీల్డ్ అవసరం',
    },
    'kh82qac6': {
      'en': 'Please choose an option from the dropdown',
      'ml': 'ഡ്രോപ്പ്ഡൗണിൽ നിന്ന് ഒരു ഓപ്ഷൻ തിരഞ്ഞെടുക്കുക',
      'ta': 'கீழ்தோன்றலில் இருந்து ஒரு விருப்பத்தைத் தேர்ந்தெடுக்கவும்',
      'te': 'దయచేసి డ్రాప్‌డౌన్ నుండి ఒక ఎంపికను ఎంచుకోండి',
    },
  },
  // viewMoreInformation
  {
    'xra98dmr': {
      'en': 'Elizabeth Surya',
      'ml': 'എലിസബത്ത് സൂര്യ',
      'ta': 'எலிசபெத் சூர்யா',
      'te': 'ఎలిజబెత్ సూర్య',
    },
    'keuq7kub': {
      'en': '26 Yrs, Krishnagire',
      'ml': '26 വയസ്സ്, കൃഷ്ണഗിരി',
      'ta': '26 வயது, கிருஷ்ணகிரி',
      'te': '26 సంవత్సరాలు, కృష్ణగిరే',
    },
    'cn192i37': {
      'en':
          '10th Kamaraj Nagar, \nChinna Elasagire, \nKrishnagire Tamil Nadu, India - 635126',
      'ml':
          'പത്താം കാമരാജ് നഗർ,\nചിന്ന എലസഗിരെ,\nകൃഷ്ണഗിരെ തമിഴ്നാട്, ഇന്ത്യ - 635126',
      'ta':
          '10வது காமராஜ் நகர்,\nசின்ன எலசகிரே,\nகிருஷ்ணகிரே தமிழ்நாடு, இந்தியா - 635126',
      'te':
          '10వ కామరాజ్ నగర్,\nచిన్న ఎలసగిరే,\nకృష్ణగిరే తమిళనాడు, భారతదేశం - 635126',
    },
    'qj3nbeps': {
      'en': 'Bachelor of Science',
      'ml': 'ബാച്ചിലർ ഓഫ് സയൻസ്',
      'ta': 'இளங்கலை அறிவியல்',
      'te': 'బ్యాచులర్ ఆఫ్ సైన్స్',
    },
    '0xy54kqu': {
      'en': '1,20,000 / year',
      'ml': '1,20,000 / വർഷം',
      'ta': '1,20,000 / ஆண்டு',
      'te': '1,20,000 / సంవత్సరం',
    },
    'p0rxan6n': {
      'en': '+91 944244 9431',
      'ml': '+91 944244 9431',
      'ta': '+91 944244 9431',
      'te': '+91 944244 9431',
    },
    'oyekryzz': {
      'en': 'Share',
      'ml': 'പങ്കിടുക',
      'ta': 'பகிர்',
      'te': 'షేర్ చేయండి',
    },
  },
  // viewListingEmpty
  {
    '5fmya01k': {
      'en': 'No Profiles to show',
      'ml': 'കാണിക്കാൻ പ്രൊഫൈലുകളൊന്നുമില്ല',
      'ta': 'காட்ட சுயவிவரங்கள் இல்லை',
      'te': 'చూపించడానికి ప్రొఫైల్‌లు లేవు',
    },
    '0qvun1xt': {
      'en':
          'We’re sorry, but there’s nothing in our database to show you. try changing your filter in the filter menu',
      'ml':
          'ക്ഷമിക്കണം, നിങ്ങളെ കാണിക്കാൻ ഞങ്ങളുടെ ഡാറ്റാബേസിൽ ഒന്നുമില്ല. ഫിൽട്ടർ മെനുവിൽ നിങ്ങളുടെ ഫിൽട്ടർ മാറ്റാൻ ശ്രമിക്കുക',
      'ta':
          'மன்னிக்கவும், ஆனால் உங்களுக்குக் காட்ட எங்கள் தரவுத்தளத்தில் எதுவும் இல்லை. வடிகட்டி மெனுவில் உங்கள் வடிகட்டியை மாற்ற முயற்சிக்கவும்',
      'te':
          'మమ్మల్ని క్షమించండి, కానీ మీకు చూపించడానికి మా డేటాబేస్‌లో ఏమీ లేదు. ఫిల్టర్ మెనులో మీ ఫిల్టర్‌ని మార్చడానికి ప్రయత్నించండి',
    },
  },
  // aboutUs
  {
    'qckzxf1f': {
      'en':
          '               கிறிஸ்துவுக்குள் மிகவும் பிரியமான சகோதர சகோதரிகளே இயேசுவின் நாமத்தில் வாழ்த்துக்கள் இந்த எலியேசர் திருமண தகவல் ஆப் உங்களுக்கு மிகவும் பிரயோஜனமாக இருக்கும் என்று கிறிஸ்துவுக்குள் விசுவாசிக்கிறேன்.\n               திருமண வயதில் அனேகர்களுக்கு ஏற்ற துணை அமையாமலும் அமைத்து கொடுப்பவர் இல்லாமலும் இருப்பதைக் கண்டு மிகுந்த வருத்தப்பட்டேன். \n               இதற்கு ஒரு தீர்வு காண வேண்டும் என்று நான் ஜெபித்த போது கர்த்தராகிய இயேசு கிறிஸ்து எனக்கு கொடுத்த தரிசனம் தான் இந்த எலியேசர் திருமண தகவல் ஆப் \n               இந்த ஆப் உங்களுக்கு ஏற்ற துணையை கண்டுபிடிக்க பேருதவியாக இருக்கும் என்று கிறிஸ்துவுக்குள் நாங்கள் நம்புகிறோம். இந்த ஆப்                \n               உங்களுக்கு முற்றிலும் இலவசமாக வழங்கப்படுகிறது . \n               நீங்கள் பயனடைந்து உங்கள் கருத்துக்களை எங்களுக்கு தெரியப்படுத்துங்கள். \n               கர்த்தர் இயேசுகிறிஸ்து தாமே உங்களை மென்மேலும் ஆசீர்வதிப்பாராக ஆமென் \n               - இப்படிக்கு உங்கள் சகோதரர் . A. சூசையப்பன்.',
      'ml':
          'ക്രിസ്തുവിനുള്ളിൽ ഏറ്റവും പ്രിയങ്കരമായ സഹോദരീസഹോദരന്മാരേ യേശുവിന്റെ നാമത്തിൽ ആശംസിക്കുന്നു\n               വിവാഹപ്രായത്തിൽ അനേകർക്ക് യോജിച്ച ഉപഭോക്താവിന് പകരം വയ്ക്കുന്നവർ ഇല്ലെങ്കിലും ഉള്ളത് കണ്ട് വളരെ വിഷമിച്ചു.\n               ഇതിന് ഒരു പരിഹാരം കാണണം എന്ന് ഞാൻ ജെപിത്തുമ്പോൾ കർത്താവായ യേശുക്രിസ്തു എനിക്ക് നൽകിയ ദർശനം ആണ് ഈ ഏലിയേസർ വിവാഹ വിവര ആപ്പ്\n               ഈ ആപ്പ് നിങ്ങൾക്കു ലഭിച്ച സഹായത്തെ കണ്ടുപിടിക്കാൻ ക്രിസ്ത്യാനികൾക്കായി ഞങ്ങൾ വിശ്വസിക്കുന്നു. ഈ ആപ്പ്\n               നിങ്ങൾക്ക് പൂർണ്ണമായും സൗജന്യമായി നൽകുന്നു .\n               നിങ്ങൾ ഉപയോഗപ്രദമായി നിങ്ങളുടെ അഭിപ്രായങ്ങൾ ഞങ്ങൾക്ക് അറിയിക്കുക.\n               കർത്താവ് യേശുക്രിസ്തു താമേ നിങ്ങളെ മെൻമേലും ആശീർവതിപ്പാരായ ആമേൻ\n               - ഇങ്ങനെക്കു നിങ്ങളുടെ സഹോദരൻ . എ.സൂസൈയപ്പൻ.',
      'ta':
          'கிறிஸ்துவுக்குள் மிகவும் பிரியமான சகோதர சகோதரிகளே இயேசுவின் நாமத்தில் வாழ்த்துக்கள் இந்த எலியேசர் திருமண தகவல் உங்களுக்கு மிகவும் பிரயோஜனமாக இருக்கும் என்று கிறிஸ்துவுக்குள் விசுவாசிக்கிறேன்.\n               திருமண வயதில் அனேகர்களுக்கு ஏற்ற துணை அமையாமலும் கொடுப்பவர் இல்லாமலும் இருப்பதைக் கண்டு மிகுந்த வருத்தப்பட்டேன்.\n               இதற்கு ஒரு தீர்வு காண வேண்டும் என்று நான் ஜெபித்த போது கர்த்தராகிய இயேசு கிறிஸ்து எனக்கு கொடுத்த தரிசனம் தான் இந்த எலியேசர் திருமண தகவல்\n               இந்த ஆப் உங்களுக்கு ஏற்ற துணையை கண்டுபிடிக்க பேருதவியாக இருக்கும் என்று கிறிஸ்துவுக்குள் நாங்கள் நம்புகிறோம். இந்த ஆப்\n               உங்களுக்கு முற்றிலும் இலவசமாக வழங்கப்படுகிறது .\n               நீங்கள் பயனடைந்து உங்கள் கருத்துக்களை எங்களுக்கு தெரியப்படுத்துங்கள்.\n               கர்த்தர் இயேசுகிறிஸ்து தாமே உங்களை மென்மேலும் ஆசீர்வதிப்பாராக ஆமென்\n               - இப்படிக்கு உங்கள் சகோதரர் . ஏ.சூசையப்பன்.',
      'te':
          'క్రిస్టియన్‌లోని అత్యంత ప్రియమైన సోదర సోదరీమణులే యేసు నామంలో శుభాకాంక్షలు ఈ ఎలియేసర్ వివాహ సమాచారం ఆప్ మీకు చాలా ప్రయోజనకరంగా ఉంటుంది.\n               వివాహ వయస్సులో అనేకర్లకు ఏర్పాటైన వ్యక్తి ఇల్లమ్మలు ఉండటంతో చాలా బాధపడ్డాను.\n               దీనికి ఒక పరిష్కారం కావాలి అని నేను జెబిత వరకు ప్రభువైన యేసు క్రీస్తు నాకు ఇచ్చిన దర్శనం ఈ ఎలియసర్ వివాహ సమాచార ఆప్\n               ఈ ఆప్ మీకు అనుకూలంగా ఉండేటటువంటి పేరును కనుగొని, క్రీస్తులో మేము నమ్ముతున్నాము. ఈ ఆప్\n               మీకు పూర్తిగా ఉచితంగా అందించబడుతుంది .\n               మీ అభిప్రాయాలను మాకు తెలియజేయండి.\n               ప్రభువు యేసుక్రీస్తు తామే మీ మెన్మేలును ఆశీర్వదింపరాగ ఆమేన్\n               - ఇప్పటికి మీ సోదరుడు . ఎ. సూశయ్యప్పన్.',
    },
    'auvsqrng': {
      'en': 'Call Us',
      'ml': 'ഞങ്ങളെ വിളിക്കൂ',
      'ta': 'எங்களை அழைக்கவும்',
      'te': 'మాకు కాల్ చేయండి',
    },
  },
  // contactUs
  {
    'yawsa0id': {
      'en': 'Contact Us',
      'ml': 'ഞങ്ങളെ സമീപിക്കുക',
      'ta': 'எங்களை தொடர்பு கொள்ள',
      'te': 'మమ్మల్ని సంప్రదించండి',
    },
    'h69tj3ch': {
      'en':
          'We’re always happy to help solve any problems you might be experiencing or even just to say hello.',
      'ml':
          'നിങ്ങൾ അനുഭവിച്ചേക്കാവുന്ന ഏതെങ്കിലും പ്രശ്‌നങ്ങൾ പരിഹരിക്കാൻ സഹായിക്കുന്നതിൽ ഞങ്ങൾ എപ്പോഴും സന്തുഷ്ടരാണ് അല്ലെങ്കിൽ ഹലോ പറയാൻ പോലും.',
      'ta':
          'நீங்கள் சந்திக்கும் அல்லது வணக்கம் சொல்லும் ஏதேனும் பிரச்சனைகளை தீர்க்க உதவுவதில் நாங்கள் எப்போதும் மகிழ்ச்சியடைகிறோம்.',
      'te':
          'మీరు ఎదుర్కొంటున్న ఏవైనా సమస్యలను పరిష్కరించడంలో సహాయం చేయడానికి లేదా హలో చెప్పడానికి కూడా మేము ఎల్లప్పుడూ సంతోషిస్తాము.',
    },
    '2rtbdrl6': {
      'en': 'Call Us',
      'ml': 'ഞങ്ങളെ വിളിക്കൂ',
      'ta': 'எங்களை அழைக்கவும்',
      'te': 'మాకు కాల్ చేయండి',
    },
  },
  // success
  {
    '74g4f6cm': {
      'en': 'Profile Uploaded',
      'ml': 'പ്രൊഫൈൽ അപ്‌ലോഡ് ചെയ്തു',
      'ta': 'சுயவிவரம் பதிவேற்றப்பட்டது',
      'te': 'ప్రొఫైల్ అప్‌లోడ్ చేయబడింది',
    },
    '2vfgqiq9': {
      'en':
          'Your profile’s information uploaded successfully. Our team will review it and make it public if everything is correct.',
      'ml':
          'നിങ്ങളുടെ പ്രൊഫൈലിന്റെ വിവരങ്ങൾ അപ്‌ലോഡ് ചെയ്തു. ഞങ്ങളുടെ ടീം അത് അവലോകനം ചെയ്യുകയും എല്ലാം ശരിയാണെങ്കിൽ അത് പരസ്യമാക്കുകയും ചെയ്യും.',
      'ta':
          'உங்கள் சுயவிவரத்தின் தகவல் வெற்றிகரமாக பதிவேற்றப்பட்டது. எங்கள் குழு அதை மதிப்பாய்வு செய்து, அனைத்தும் சரியாக இருந்தால் பொதுவில் வெளியிடும்.',
      'te':
          'మీ ప్రొఫైల్ సమాచారం విజయవంతంగా అప్‌లోడ్ చేయబడింది. మా బృందం దాన్ని సమీక్షిస్తుంది మరియు ప్రతిదీ సరిగ్గా ఉంటే పబ్లిక్ చేస్తుంది.',
    },
  },
  // Miscellaneous
  {
    'i1a7mo84': {
      'en': '',
      'ml': '',
      'ta': '',
      'te': '',
    },
    'cd5kbnxy': {
      'en': '',
      'ml': '',
      'ta': '',
      'te': '',
    },
    'l7dq4dfn': {
      'en': '',
      'ml': '',
      'ta': '',
      'te': '',
    },
    'spm2yzb5': {
      'en': '',
      'ml': '',
      'ta': '',
      'te': '',
    },
    'f44qa66w': {
      'en': '',
      'ml': '',
      'ta': '',
      'te': '',
    },
    'x1bl7qrk': {
      'en': '',
      'ml': '',
      'ta': '',
      'te': '',
    },
    'c5xv49gs': {
      'en': '',
      'ml': '',
      'ta': '',
      'te': '',
    },
    'nvja1kxc': {
      'en': '',
      'ml': '',
      'ta': '',
      'te': '',
    },
    'mgomle7z': {
      'en': '',
      'ml': '',
      'ta': '',
      'te': '',
    },
    'r5lc3wnd': {
      'en': '',
      'ml': '',
      'ta': '',
      'te': '',
    },
    '1af9rpjq': {
      'en': '',
      'ml': '',
      'ta': '',
      'te': '',
    },
    'cwodj67g': {
      'en': '',
      'ml': '',
      'ta': '',
      'te': '',
    },
    '4a0jyqgx': {
      'en': '',
      'ml': '',
      'ta': '',
      'te': '',
    },
    '48khhvc1': {
      'en': '',
      'ml': '',
      'ta': '',
      'te': '',
    },
    '60aiy361': {
      'en': '',
      'ml': '',
      'ta': '',
      'te': '',
    },
    'gn35mbiy': {
      'en': '',
      'ml': '',
      'ta': '',
      'te': '',
    },
    'z8mqc3qw': {
      'en': '',
      'ml': '',
      'ta': '',
      'te': '',
    },
    '5ifjq068': {
      'en': '',
      'ml': '',
      'ta': '',
      'te': '',
    },
    '5c2e379s': {
      'en': '',
      'ml': '',
      'ta': '',
      'te': '',
    },
    '0n6z5042': {
      'en': '',
      'ml': '',
      'ta': '',
      'te': '',
    },
    'n6a7an00': {
      'en': '',
      'ml': '',
      'ta': '',
      'te': '',
    },
    'urbnjplw': {
      'en': '',
      'ml': '',
      'ta': '',
      'te': '',
    },
  },
].reduce((a, b) => a..addAll(b));
